Documents/упИзменениеПараметровГрузовыхМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упИзменениеПараметровГрузовыхМест</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упПараметрыЗаданияНаПеревозку</xr:Item>
				<xr:Item>InformationRegister.упПараметрыЗаявкиНаПеревозку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрузовыеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Масса</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗагрузочныхМетров</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/упПараметрыВводаИнформацииОГрузовыхМестах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упПараметрыВводаИнформацииОГрузовыхМестах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВводится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводитсяВЗаявкеНаПеревозку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводитсяВЗаданииДоПланированияРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводитсяВЗаданииДоНачалаВыполненияРейса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упГрузовыеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГрузовыеМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БеречьОтВлаги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтИзлучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтНагрева</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаяФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упДоступныеФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноПробитиеЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноСкладироватьДругНаДруга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контейнер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийГрузПоЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПредоплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хрупкий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварныйСоставГруза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНоменклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковкаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упУпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитическийРазрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/упИзменениеПараметровГрузовыхМест/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
			
	ЭтаФорма.УчитыватьМассу = ПолучитьФункциональнуюОпцию("упУчитыватьМассу");
	ЭтаФорма.УчитыватьОбъем = ПолучитьФункциональнуюОпцию("упУчитыватьОбъем");
	ЭтаФорма.УчитыватьКоличествоМест = ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоМест");
	ЭтаФорма.УчитыватьКоличествоЗагрузочныхМетров = ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоЗагрузочныхМетров");
	ЭтаФорма.УчитыватьЛинейныеРазмеры = ПолучитьФункциональнуюОпцию("упУчитыватьЛинейныеРазмеры");
	
	ПриСозданииПриЧтенииНаСервере();
	
	ДоступныеСтатусыЗаданийДляОснования = Документы.упИзменениеПараметровГрузовыхМест.ДоступныеСтатусыЗаданийДляОснования();
	
	ЭтаФорма.КоэффициентПересчетаОбъема = упСервисныеФункции.ПолучитьЗначениеКонстанты("упКоэффициентПересчетаОбъема");
	
	ЗаданиеНаПеревозкуГрузаДоИзменения = Объект.ЗаданиеНаПеревозкуГруза;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
		
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	УстановитьЗаголовкиПоказателейЗагрузки();
	
	НастроитьФормуПоВидуПеревозки();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Истина
		И ГрузМодифицирован
		И ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится 
	Тогда
		Если ТекущийОбъект.ГрузовыеМеста.Количество() > 0 Тогда
			СтрокаГМ = ТекущийОбъект.ГрузовыеМеста[0];
		Иначе	
			СтрокаГМ = ТекущийОбъект.ГрузовыеМеста.Добавить();
			СтрокаГМ.ГрузовоеМесто = Справочники.упГрузовыеМеста.ПустаяСсылка();
		КонецЕсли;
		СтрокаГМ.Высота = ВысотаГруза;
		СтрокаГМ.Ширина = ШиринаГруза;
		СтрокаГМ.Длина = ДлинаГруза;
		СтрокаГМ.Масса = Масса;
		СтрокаГМ.Объем = Объем;
		СтрокаГМ.КоличествоМест = КоличествоМест;
		СтрокаГМ.КоличествоЗагрузочныхМетров = КоличествоЗагрузочныхМетров;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗаданиеНаПеревозкуГрузаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	сткПараметры = Новый Структура("Отбор", СтруктураОтбораЗадания());
	ОткрытьФорму("Документ.упЗаданиеНаПеревозкуГруза.ФормаВыбора", сткПараметры, Элемент);	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеНаПеревозкуГрузаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Отбор = СтруктураОтбораЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеНаПеревозкуГрузаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Отбор = СтруктураОтбораЗадания();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ГрузовыеМестаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьЗаголовкиПоказателейЗагрузки();
КонецПроцедуры

&НаКлиенте
Процедура ГрузовыеМестаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГрузовыеМестаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГрузовыеМестаДлинаПриИзменении(Элемент)
	упОбработкаТабличнойЧастиКлиент.ГрузРазмерПриИзменении(Элементы.ГрузовыеМеста.ТекущиеДанные, 1);
КонецПроцедуры

&НаКлиенте
Процедура ГрузовыеМестаШиринаПриИзменении(Элемент)
	упОбработкаТабличнойЧастиКлиент.ГрузРазмерПриИзменении(Элементы.ГрузовыеМеста.ТекущиеДанные, 1);
КонецПроцедуры

&НаКлиенте
Процедура ГрузовыеМестаВысотаПриИзменении(Элемент)
	упОбработкаТабличнойЧастиКлиент.ГрузРазмерПриИзменении(Элементы.ГрузовыеМеста.ТекущиеДанные, 1);
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	ГрузМодифицирован = Истина;
	ПриИзмененииРазмеров();
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	ГрузМодифицирован = Истина;
	ПриИзмененииРазмеров();	
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПриИзменении(Элемент)
	ГрузМодифицирован = Истина;
	ПриИзмененииРазмеров();	
КонецПроцедуры

&НаКлиенте
Процедура МассаПриИзменении(Элемент)
	ГрузМодифицирован = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъемПриИзменении(Элемент)
	ГрузМодифицирован = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМестПриИзменении(Элемент)
	ГрузМодифицирован = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗагрузочныхМетровПриИзменении(Элемент)
	ГрузМодифицирован = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаОснованииНаКлиенте();
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
    УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьНаОснованииНаСервере(ТекстОшибки)
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Заполнить(Объект.ЗаданиеНаПеревозкуГруза);
	ТекстОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства, "ТекстОшибки");
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	НастроитьФормуПоВидуПеревозки();
	ЗаполнитьПараметрыГрузовыхМест();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаОснованииНаКлиенте()
	Если Ложь
		Или ГрузМодифицирован
		Или Объект.ГрузовыеМеста.Количество() > 0
	Тогда
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОбработатьОтветНаВопросПрезаполнениеПараметровГрузовыхМест", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, НСтр("ru='Параметры грузовых мест будут перезаполнены. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе	
		ЗаполнитьНаОснованииЗаявкиНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаВопросПрезаполнениеПараметровГрузовыхМест(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаОснованииЗаявкиНаКлиенте();
		ЗаданиеНаПеревозкуГрузаДоИзменения = Объект.ЗаданиеНаПеревозкуГруза;
	Иначе
		Объект.ЗаданиеНаПеревозкуГруза = ЗаданиеНаПеревозкуГрузаДоИзменения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаОснованииЗаявкиНаКлиенте()
	ТекстОшибки = "";
	ЗаполнитьНаОснованииНаСервере(ТекстОшибки);	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиПоказателейЗагрузки()
	
	сткПредставления = упСервисныеФункции.ПолучитьПредставлениеПоказателейЗагрузки(УчитыватьМассу, УчитыватьОбъем, УчитыватьКоличествоМест, УчитыватьЛинейныеРазмеры);
	
	Если УчитыватьМассу Тогда
		ЕИ_Масса = сткПредставления.Масса;
		МассаПредставление = НСтр(СтрШаблон("ru = '%1 %2'", Объект.ГрузовыеМеста.Итог("Масса"), ЕИ_Масса));
		Элементы.ГрузовыеМестаМасса.Заголовок = НСтр(СтрШаблон("ru = 'Масса (%1)'", ЕИ_Масса));
	КонецЕсли;
	Если УчитыватьОбъем Тогда
		ЕИ_Объем = сткПредставления.Объем;
		ОбъемПредставление = НСтр(СтрШаблон("ru = '%1 %2'", Объект.ГрузовыеМеста.Итог("Объем"), ЕИ_Объем));
		Элементы.ГрузовыеМестаОбъем.Заголовок = НСтр(СтрШаблон("ru = 'Объем (%1)'", ЕИ_Объем));
	КонецЕсли;
	
	Если УчитыватьКоличествоМест Тогда
		ЕИ_Грузов = сткПредставления.КоличествоМест;
		КоличествоМестПредставление = НСтр(СтрШаблон("ru = '%1 %2'", Объект.ГрузовыеМеста.Итог("КоличествоМест"), ЕИ_Грузов));
		Элементы.ГрузовыеМестаКоличествоМест.Заголовок = НСтр(СтрШаблон("ru = 'Кол. мест (%1)'", ЕИ_Грузов));
	КонецЕсли;
	
	Если УчитыватьЛинейныеРазмеры Тогда
		ЕИ_Длины = сткПредставления.КоличествоЗагрузочныхМетров;
	КонецЕсли;
	
	Элементы.Декорация1.Видимость = УчитыватьЛинейныеРазмеры;
	Элементы.Декорация2.Видимость = УчитыватьЛинейныеРазмеры;
	
	Если УчитыватьКоличествоЗагрузочныхМетров Тогда
		КоличествоЗагрузочныхМетровПредставление = НСтр(СтрШаблон("ru = '%1'", Объект.ГрузовыеМеста.Итог("КоличествоЗагрузочныхМетров")));
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗаголовкиПоказателейЗагрузки()

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаданиеНаПеревозкуГрузаПриИзменении(Элемент)
	ЗаполнитьНаОснованииНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВидаПеревозки()
	
	Если ЗначениеЗаполнено(Объект.ЗаданиеНаПеревозкуГруза) Тогда
		ПараметрыВводаИнформацииОГрузовыхМестах = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗаданиеНаПеревозкуГруза, "ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах");
	Иначе
		ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ПустаяСсылка();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВидуПеревозки() Экспорт
	
	УстановитьПараметрыВидаПеревозки();
	ИнформацияПоГрузовымМестамВводится = Ложь;
	
	ИнформацияПоГрузовымМестамВводится = Истина
									И ЗначениеЗаполнено(ПараметрыВводаИнформацииОГрузовыхМестах)
									И ПараметрыВводаИнформацииОГрузовыхМестах <> Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится; 

	Элементы.ГрузовыеМеста.Видимость = ИнформацияПоГрузовымМестамВводится;
	Элементы.ГруппаПараметрыГрузовогоМеста.Видимость = НЕ ИнформацияПоГрузовымМестамВводится;	
	
	Если НЕ ИнформацияПоГрузовымМестамВводится Тогда
		ЗаполнитьПараметрыГрузовыхМест();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыГрузовыхМест()
	Если Объект.ГрузовыеМеста.Количество() > 0 Тогда
		ПерваяСтрока = Объект.ГрузовыеМеста[0];
		Масса = ПерваяСтрока.Масса;
		Объем = ПерваяСтрока.Объем;
		КоличествоМест = ПерваяСтрока.КоличествоМест;
		КоличествоЗагрузочныхМетров = ПерваяСтрока.КоличествоЗагрузочныхМетров;
		ШиринаГруза = ПерваяСтрока.Ширина;
		ДлинаГруза = ПерваяСтрока.Длина;
		ВысотаГруза = ПерваяСтрока.Высота;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРазмеров()

	Объем = ШиринаГруза * ВысотаГруза * ДлинаГруза * КоэффициентПересчетаОбъема;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураОтбораЗадания()
	
	Результат = Новый Структура();
	Результат.Вставить("Статус", ДоступныеСтатусыЗаданийДляОснования);
	Результат.Вставить("РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава", Ложь);

	Возврат Результат;
	
КонецФункции


#КонецОбласти
